<?xml version="1.0" encoding="ISO-8859-1" standalone="no"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1" />
    <title>Chapter 1. &#27010;&#35201;</title>
    <link rel="stylesheet" href="style.css" type="text/css" />
    <meta name="generator" content="DocBook XSL Stylesheets V1.72.0" />
    <link rel="start" href="index.html" title="XooNIps Version3.45" />
    <link rel="up" href="index.html" title="XooNIps Version3.45" />
    <link rel="prev" href="index.html" title="XooNIps Version3.45" />
    <link rel="next" href="startguide.html" title="Chapter 2. &#12473;&#12479;&#12540;&#12488;&#12460;&#12452;&#12489;" />
  </head>
  <body>
    <div id="page">
      <div class="navheader">
        <table width="100%" summary="Navigation header">
          <tr>
            <td width="20%" align="left"><a accesskey="p" href="index.html"><img src="images\etc\prev.gif" alt="Prev" /></a> </td>
            <th width="60%" align="center"> </th>
            <td width="20%" align="right"> <a accesskey="n" href="startguide.html"><img src="images\etc\next.gif" alt="Next" /></a></td>
          </tr>
        </table>
        <hr />
      </div>
      <div class="chapter" lang="en" id="overview" xml:lang="en">
        <div xmlns="" class="titlepage">
          <div>
            <div>
              <h2 xmlns="http://www.w3.org/1999/xhtml" class="title"><a id="overview"></a>Chapter 1. &#27010;&#35201;</h2>
            </div>
          </div>
        </div>
        <div class="section" lang="en" xml:lang="en">
          <div xmlns="" class="titlepage">
            <div>
              <div>
                <h2 xmlns="http://www.w3.org/1999/xhtml" class="title" style="clear: both"><a id="overview.whatisxoonips"></a>1. XooNIps&#12392;&#12399;&#65311;</h2>
              </div>
            </div>
          </div>
          <p>XooNIps&#12399;&#30740;&#31350;&#35542;&#25991;&#12420;&#23455;&#39443;&#12487;&#12540;&#12479;&#12289;&#25968;&#29702;&#12514;&#12487;&#12523;&#12289;&#12503;&#12525;&#12464;&#12521;&#12512;&#12392;&#12356;&#12358;&#12424;&#12358;&#12394;&#22810;&#27096;&#12394;&#24773;&#22577;&#12395;&#12513;&#12479;&#24773;&#22577;&#12434;&#20184;&#21152;&#12375;&#12390;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#19978;&#12391;&#19990;&#30028;&#20013;&#12398;&#20154;&#12293;&#12392;&#24773;&#22577;&#12434;&#20849;&#26377;&#12377;&#12427;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12469;&#12452;&#12488;&#12434;&#31777;&#21336;&#12395;&#20316;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12391;&#12377;&#12290;</p>
          <p>&#12377;&#12394;&#12431;&#12385;&#12289;&#23455;&#39443;&#12487;&#12540;&#12479;&#12420;&#25968;&#29702;&#12514;&#12487;&#12523;&#12503;&#12525;&#12464;&#12521;&#12512;&#12394;&#12393;&#12434;&#21033;&#29992;&#12377;&#12427;&#31070;&#32076;&#31185;&#23398;&#32773;&#12398;&#28858;&#12398;&#12491;&#12517;&#12540;&#12525;&#12452;&#12531;&#12501;&#12457;&#12510;&#12486;&#12451;&#12463;&#12473;&#12484;&#12540;&#12523;&#12391;&#12377;&#12290;</p>
          <p>&#12491;&#12517;&#12540;&#12525;&#12452;&#12531;&#12501;&#12457;&#12510;&#12486;&#12451;&#12463;&#12473;&#12399;&#33075;&#12398;&#35598;&#12434;&#35299;&#26126;&#12377;&#12427;&#28858;&#12398;&#31361;&#30772;&#21475;&#12392;&#12375;&#12390;&#31070;&#32076;&#31185;&#23398;&#12392;&#24773;&#22577;&#23398;&#12434;&#34701;&#21512;&#12373;&#12379;&#12383;&#26032;&#12375;&#12356;&#30740;&#31350;&#20998;&#37326;&#12391;&#12377;&#12290;2005&#24180;11&#26376;&#12395;&#12371;&#12358;&#12375;&#12383;&#23398;&#38555;&#30340;&#20998;&#37326;&#12398;&#22269;&#38555;&#21332;&#21147;&#12434;&#20419;&#36914;&#12377;&#12427;&#12383;&#12417;&#12395;&#12491;&#12517;&#12540;&#12525;&#12452;&#12531;&#12501;&#12457;&#12510;&#12486;&#12451;&#12463;&#12473;&#22269;&#38555;&#32113;&#21512;&#27231;&#27083;(INCF&#65289;&#12364;&#35373;&#31435;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;&#12371;&#12398;&#12424;&#12358;&#12394;&#29366;&#27841;&#12398;&#20013;&#12289;&#29702;&#30740;BSI&#12398;NI&#12481;&#12540;&#12512;&#12399;XooNIps&#12398;&#38283;&#30330;&#12395;&#30528;&#25163;&#12375;&#12289;&#29694;&#22312;&#12501;&#12522;&#12540;&#12398;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12392;&#12375;&#12390;&#20844;&#38283;&#65288;<code class="uri">http://xoonips.sourceforge.jp/</code>&#65289;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12414;&#12383;&#26368;&#36817;&#12391;&#12399;&#24773;&#22577;&#20849;&#26377;&#12398;&#28858;&#12398;&#12522;&#12509;&#12472;&#12488;&#12522;&#12484;&#12540;&#12523;&#12392;&#12375;&#12390;&#22259;&#26360;&#39208;&#12420;&#30740;&#31350;&#27231;&#38306;&#12391;&#12398;&#21033;&#29992;&#12418;&#24195;&#12364;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
          <p>&#20027;&#12394;&#29305;&#24500;</p>
          <div class="itemizedlist">
            <ul type="bullet">
              <li style="list-style-type: disc">
                <p>XooNIps &#12391;&#12399;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12471;&#12473;&#12486;&#12512;&#12395;&#31934;&#36890;&#12375;&#12390;&#12356;&#12394;&#12367;&#12390;&#12418;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12469;&#12452;&#12488;&#12434;&#27083;&#31689;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
              </li>
              <li style="list-style-type: disc">
                <p>XooNIps &#12399;WEB&#12469;&#12452;&#12488;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#31649;&#29702;&#12377;&#12427;&#27231;&#33021;&#12434;&#25345;&#12388;&#12398;&#12391;&#12289;&#12518;&#12540;&#12470;&#12399;WEB&#12469;&#12452;&#12488;&#12398;&#12487;&#12470;&#12452;&#12531;&#12395;&#38598;&#20013;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
              </li>
              <li style="list-style-type: disc">
                <p>XooNIps &#12399;WEB&#12469;&#12452;&#12488;&#12395;&#30331;&#37682;&#12373;&#12428;&#12383;&#12467;&#12531;&#12486;&#12531;&#12484;&#12398;&#21697;&#36074;&#31649;&#29702;&#12398;&#27231;&#33021;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290;</p>
              </li>
            </ul>
          </div>
          <p>&#12394;&#12362;&#12289;2007&#24180;4&#26376;&#12363;&#12425;&#29702;&#30740;BSI&#12398;NIJC&#12364;XooNIps&#12398;&#27231;&#33021;&#36861;&#21152;&#12394;&#12393;&#38283;&#30330;&#12539;&#36939;&#21942;&#31649;&#29702;&#12434;&#24341;&#12365;&#32153;&#12356;&#12391;&#12356;&#12414;&#12377;&#12290;</p>
        </div>
        <div class="section" lang="en" xml:lang="en">
          <div xmlns="" class="titlepage">
            <div>
              <div>
                <h2 xmlns="http://www.w3.org/1999/xhtml" class="title" style="clear: both"><a id="overview.mainfeatures"></a>2. XooNIps&#12398;&#20027;&#12394;&#27231;&#33021;</h2>
              </div>
            </div>
          </div>
          <p> </p>
          <div class="section" lang="en" xml:lang="en">
            <div xmlns="" class="titlepage">
              <div>
                <div>
                  <h3 xmlns="http://www.w3.org/1999/xhtml" class="title"><a id="overview.mainfeatures.flexible"></a>2.1. &#26580;&#36575;&#12394;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#27083;&#31689;</h3>
                </div>
              </div>
            </div>
            <p> </p>
            <div class="section" lang="en" xml:lang="en">
              <div xmlns="" class="titlepage">
                <div>
                  <div>
                    <h4 xmlns="http://www.w3.org/1999/xhtml" class="title"><a id="overview.mainfeatures.flexible.setup"></a>2.1.1. &#31649;&#29702;&#30011;&#38754;&#12391;&#12398;&#35373;&#23450;</h4>
                  </div>
                </div>
              </div>
              <p>&#12469;&#12452;&#12488;&#12398;&#36939;&#21942;&#12395;&#38306;&#12377;&#12427;&#38917;&#30446; (&#20363; &#12518;&#12540;&#12470;&#12398;&#30331;&#37682;&#26041;&#27861;&#12420;&#12450;&#12452;&#12486;&#12512;&#12398;&#20844;&#38283;&#26041;&#27861;&#12394;&#12393;) &#12399;&#31649;&#29702;&#30011;&#38754;&#12391;&#36969;&#20999;&#12394;&#38917;&#30446;&#12434;&#36984;&#12406;&#12371;&#12392;&#12391;&#31777;&#21336;&#12395;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
              <div class="figure">
                <a id="overview.mainfeatures.flexible.setup.fig.overview01"></a>
                <div class="figure-contents">
                  <div class="mediaobject">
                    <img src="images\overview01.png" alt="&#31649;&#29702;&#30011;&#38754;" />
                  </div>
                </div>
                <p class="title">
                  <b>Figure 1.1. &#31649;&#29702;&#30011;&#38754;</b>
                </p>
              </div>
              <br class="figure-break" />
              <p>&#35373;&#23450;&#38917;&#30446;&#12398;&#19968;&#20363;:</p>
              <div class="itemizedlist">
                <ul type="bullet">
                  <li style="list-style-type: disc">
                    <p>&#12518;&#12540;&#12470;&#30331;&#37682;&#12395;&#12362;&#12369;&#12427;&#35373;&#23450;&#38917;&#30446;</p>
                    <div class="itemizedlist">
                      <ul type="opencircle">
                        <li style="list-style-type: circle">
                          <p>
				  [&#12514;&#12487;&#12524;&#12540;&#12479;&#12364;&#26032;&#35215;&#12518;&#12540;&#12470;&#12398;&#30331;&#37682;&#12434;&#25215;&#35469;&#12434;&#12377;&#12427;]
				  (&#12514;&#12487;&#12524;&#12540;&#12479;&#12364;&#26032;&#35215;&#12518;&#12540;&#12470;&#12398;&#12503;&#12525;&#12501;&#12451;&#12540;&#12523;&#12434;&#30906;&#35469;&#12375;&#12390;&#12363;&#12425;&#30331;&#37682;&#12434;&#25215;&#35469;&#12377;&#12427;)
				</p>
                        </li>
                        <li style="list-style-type: circle">
                          <p>[&#33258;&#21205;&#30340;&#12395;&#30331;&#37682;&#12434;&#25215;&#35469;&#12377;&#12427;]</p>
                        </li>
                      </ul>
                    </div>
                  </li>
                  <li style="list-style-type: disc">
                    <p>&#12450;&#12452;&#12486;&#12512;&#65288;&#12467;&#12531;&#12486;&#12531;&#12484;&#65289;&#20844;&#38283;&#12395;&#12362;&#12369;&#12427;&#35373;&#23450;&#38917;&#30446;</p>
                    <div class="itemizedlist">
                      <ul type="opencircle">
                        <li style="list-style-type: circle">
                          <p>
				  [&#12514;&#12487;&#12524;&#12540;&#12479;&#12364;&#20844;&#38283;&#12434;&#25215;&#35469;&#12377;&#12427;]
				  (&#20844;&#38283;&#12377;&#12427;&#21069;&#12395;&#12450;&#12452;&#12486;&#12512;&#12398;&#20869;&#23481;&#12434;&#30906;&#35469;&#12377;&#12427;)
				</p>
                        </li>
                        <li style="list-style-type: circle">
                          <p>[&#33258;&#21205;&#30340;&#12395;&#20844;&#38283;&#12434;&#25215;&#35469;&#12377;&#12427;]</p>
                        </li>
                      </ul>
                    </div>
                  </li>
                </ul>
              </div>
            </div>
            <div class="section" lang="en" xml:lang="en">
              <div xmlns="" class="titlepage">
                <div>
                  <div>
                    <h4 xmlns="http://www.w3.org/1999/xhtml" class="title"><a id="overview.mainfeautures.flexible.setup2"></a>2.1.2. &#12450;&#12452;&#12486;&#12512;&#65288;&#12467;&#12531;&#12486;&#12531;&#12484;&#65289;&#12398;&#30331;&#37682;&#38936;&#22495;</h4>
                  </div>
                </div>
              </div>
              <div class="itemizedlist">
                <ul type="bullet">
                  <li style="list-style-type: disc">
                    <p>Public&#38936;&#22495;</p>
                    <div class="itemizedlist">
                      <ul type="opencircle">
                        <li style="list-style-type: circle">
                          <p>&#12371;&#12398;&#38936;&#22495;&#12395;&#30331;&#37682;&#12373;&#12428;&#12383;&#12450;&#12452;&#12486;&#12512;&#12399;&#35504;&#12391;&#12418;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12371;&#12392;&#12364;&#21487;&#33021;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
                        </li>
                        <li style="list-style-type: circle">
                          <p>&#12371;&#12398;&#38936;&#22495;&#12395;&#12450;&#12452;&#12486;&#12512;&#12434;&#30331;&#37682;&#12375;&#12390;&#20844;&#38283;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12514;&#12487;&#12524;&#12540;&#12479;&#12398;&#25215;&#35469;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;</p>
                        </li>
                      </ul>
                    </div>
                  </li>
                  <li style="list-style-type: disc">
                    <p>Group&#38936;&#22495;</p>
                    <div class="itemizedlist">
                      <ul type="opencircle">
                        <li style="list-style-type: circle">
                          <p>&#30331;&#37682;&#12518;&#12540;&#12470;&#12391;&#12464;&#12523;&#12540;&#12503;&#12434;&#20316;&#12426;&#12289;&#12464;&#12523;&#12540;&#12503;&#12398;&#12415;&#12364;&#12450;&#12463;&#12475;&#12473;&#20986;&#26469;&#12427;&#38936;&#22495;&#12391;&#12377;&#12290;</p>
                        </li>
                        <li style="list-style-type: circle">
                          <p>&#12464;&#12523;&#12540;&#12503;&#38936;&#22495;&#12395;&#12450;&#12452;&#12486;&#12512;&#12434;&#30331;&#37682;&#12375;&#12390;&#12464;&#12523;&#12540;&#12503;&#12391;&#20849;&#26377;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#32773;&#12398;&#25215;&#35469;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;</p>
                        </li>
                      </ul>
                    </div>
                  </li>
                  <li style="list-style-type: disc">
                    <p>Private&#38936;&#22495;</p>
                    <div class="itemizedlist">
                      <ul type="opencircle">
                        <li style="list-style-type: circle">
                          <p>&#12469;&#12452;&#12488;&#12395;&#30331;&#37682;&#12375;&#12390;&#12356;&#12427;&#12518;&#12540;&#12470;&#20491;&#20154;&#12398;&#38936;&#22495;&#12391;&#12377;&#12290;&#12518;&#12540;&#12470;&#20491;&#20154;&#12398;&#38936;&#22495;&#12392;&#12375;&#12390;&#33258;&#30001;&#12395;&#21033;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
                        </li>
                      </ul>
                    </div>
                  </li>
                </ul>
              </div>
            </div>
            <div class="section" lang="en" xml:lang="en">
              <div xmlns="" class="titlepage">
                <div>
                  <div>
                    <h4 xmlns="http://www.w3.org/1999/xhtml" class="title"><a id="overview.mainfeautures.flexible.setup3"></a>2.1.3. XooNIps&#12364;&#12505;&#12540;&#12473;&#12392;&#12375;&#12390;&#12356;&#12427;XOOPS</h4>
                  </div>
                </div>
              </div>
              <p>XOOPS&#12434;&#21033;&#29992;&#12377;&#12427;&#12371;&#12392;&#12391;&#20197;&#19979;&#12398;&#21033;&#28857;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
              <div class="itemizedlist">
                <ul type="bullet">
                  <li style="list-style-type: disc">
                    <p>&#12471;&#12473;&#12486;&#12512;&#12398;&#27083;&#31689;&#12392;&#36939;&#21942;&#12398;&#36027;&#29992;&#12434;&#25233;&#12360;&#12427;</p>
                    <div class="itemizedlist">
                      <ul type="opencircle">
                        <li style="list-style-type: circle">
                          <p>XOOPS &#12399;&#12458;&#12540;&#12503;&#12531;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12394;&#12398;&#12391;&#12501;&#12522;&#12540;&#12391;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12390;&#21033;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
                        </li>
                      </ul>
                    </div>
                  </li>
                  <li style="list-style-type: disc">
                    <p>&#27231;&#33021;&#25313;&#24373;&#12364;&#23481;&#26131;</p>
                    <div class="itemizedlist">
                      <ul type="opencircle">
                        <li style="list-style-type: circle">
                          <p>&#22810;&#24425;&#12394;XOOPS &#12398;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#21033;&#29992;&#12377;&#12427;&#12371;&#12392;&#12391;&#27096;&#12293;&#12394;&#24418;&#24907;&#12398;&#12469;&#12452;&#12488;&#12434;&#20316;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
                        </li>
                      </ul>
                    </div>
                  </li>
                  <li style="list-style-type: disc">
                    <p>&#12469;&#12452;&#12488;&#12487;&#12470;&#12452;&#12531;(&#35211;&#12383;&#30446;&#65289;&#12398;&#22793;&#26356;&#12364;&#23481;&#26131;</p>
                    <div class="itemizedlist">
                      <ul type="opencircle">
                        <li style="list-style-type: circle">
                          <p>&#22810;&#24425;&#12394;XOOPS &#12398;&#12486;&#12540;&#12510;&#12434;&#21033;&#29992;&#12377;&#12427;&#12371;&#12392;&#12391;&#12469;&#12452;&#12488;&#12398;&#12487;&#12470;&#12452;&#12531;&#12434;&#31777;&#21336;&#12395;&#22793;&#26356;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
                        </li>
                      </ul>
                    </div>
                  </li>
                </ul>
              </div>
              <div class="figure">
                <a id="overview.mainfeatures.flexible.setup3.fig.overview02"></a>
                <div class="figure-contents">
                  <div class="mediaobject">
                    <img src="images\overview02.png" alt="CMS system&#27010;&#35201;" />
                  </div>
                </div>
                <p class="title">
                  <b>Figure 1.2. CMS system&#27010;&#35201;</b>
                </p>
              </div>
              <br class="figure-break" />
            </div>
          </div>
          <div class="section" lang="en" xml:lang="en">
            <div xmlns="" class="titlepage">
              <div>
                <div>
                  <h3 xmlns="http://www.w3.org/1999/xhtml" class="title"><a id="overview.mainfeatures.classification"></a>2.2. &#12487;&#12540;&#12479;&#12398;&#20998;&#39006;</h3>
                </div>
              </div>
            </div>
            <p> </p>
            <div class="section" lang="en" xml:lang="en">
              <div xmlns="" class="titlepage">
                <div>
                  <div>
                    <h4 xmlns="http://www.w3.org/1999/xhtml" class="title"><a id="overview.mainfeatures.classification.itemtype"></a>2.2.1. &#12450;&#12452;&#12486;&#12512;&#12479;&#12452;&#12503;&#12395;&#12424;&#12427;&#12487;&#12540;&#12479;&#12398;&#20998;&#39006;</h4>
                  </div>
                </div>
              </div>
              <p>XooNIps &#12399;12&#31278;&#39006;&#12398;&#30064;&#12394;&#12387;&#12383;&#12487;&#12540;&#12479;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12434;&#12450;&#12452;&#12486;&#12512;&#12479;&#12452;&#12503;&#12392;&#12375;&#12390;&#29992;&#24847;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#20170;&#24460;&#26032;&#12375;&#12356;&#12479;&#12452;&#12503;&#12398;&#12487;&#12540;&#12479;&#12364;&#20986;&#12390;&#12365;&#12383;&#22580;&#21512;&#12395;&#12399;&#26032;&#12383;&#12395;&#12450;&#12452;&#12486;&#12512;&#12479;&#12452;&#12503;&#12434;&#20316;&#25104;&#12377;&#12427;&#12371;&#12392;&#12391;&#23550;&#24540;&#12377;&#12427;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12377;&#12290;</p>
            </div>
            <div class="section" lang="en" xml:lang="en">
              <div xmlns="" class="titlepage">
                <div>
                  <div>
                    <h4 xmlns="http://www.w3.org/1999/xhtml" class="title"><a id="overview.mainfeatures.classification.indextree"></a>2.2.2. &#12450;&#12452;&#12486;&#12512;&#12398;&#20998;&#39006;&#12392;&#25972;&#29702;&#12395;&#12399;Index Tree</h4>
                  </div>
                </div>
              </div>
              <p>&#12450;&#12452;&#12486;&#12512;&#12399;IndexTree&#12391;&#25972;&#29702;&#12375;&#12414;&#12377;&#12290;IndexTree &#12399;&#12450;&#12452;&#12486;&#12512;&#12398;&#30331;&#37682;&#38936;&#22495;&#27598;&#12395;Public&#12289;Group&#12289;Private&#12398;&#12479;&#12502;&#12391;&#20998;&#39006;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12381;&#12428;&#12382;&#12428;&#12398;&#12479;&#12502;&#12395;&#12399;&#12461;&#12540;&#12527;&#12540;&#12489;&#12391;&#32048;&#12363;&#12367;&#12450;&#12452;&#12486;&#12512;&#12434;&#20998;&#39006;&#30331;&#37682;&#12377;&#12427;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12377;&#12290;</p>
              <div class="figure">
                <a id="overview.mainfeatures.classification.indextree.fig.overview03"></a>
                <div class="figure-contents">
                  <div class="mediaobject">
                    <img src="images\overview03.png" alt="XooNIps&#12398;&#22522;&#26412;&#30011;&#38754;" />
                  </div>
                </div>
                <p class="title">
                  <b>Figure 1.3. XooNIps&#12398;&#22522;&#26412;&#30011;&#38754;</b>
                </p>
              </div>
              <br class="figure-break" />
            </div>
            <div class="section" lang="en" xml:lang="en">
              <div xmlns="" class="titlepage">
                <div>
                  <div>
                    <h4 xmlns="http://www.w3.org/1999/xhtml" class="title"><a id="overview.mainfeatures.classification.datasearch"></a>2.2.3. &#12487;&#12540;&#12479;&#12398;&#26908;&#32034;</h4>
                  </div>
                </div>
              </div>
              <p>XooNIps&#12391;&#12399;&#20197;&#19979;&#12398;&#26908;&#32034;&#26041;&#27861;&#12391;&#30331;&#37682;&#12450;&#12452;&#12486;&#12512;&#12434;&#26908;&#32034;&#20986;&#26469;&#12414;&#12377;</p>
              <div class="itemizedlist">
                <ul type="bullet">
                  <li style="list-style-type: disc">
                    <p>IndexTree&#12363;&#12425;&#12398;&#26908;&#32034;</p>
                    <div class="itemizedlist">
                      <ul type="opencircle">
                        <li style="list-style-type: circle">
                          <p>&#26908;&#32034;&#12375;&#12383;&#12356;&#12479;&#12502;(Public&#12289;Group&#12289;Private&#65289;&#12398;IndexTree&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#30331;&#37682;&#12373;&#12428;&#12390;&#12356;&#12427;&#12450;&#12452;&#12486;&#12512;&#12398;&#12522;&#12473;&#12488;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
                        </li>
                      </ul>
                    </div>
                  </li>
                  <li style="list-style-type: disc">
                    <p>Keyword &#26908;&#32034;</p>
                    <div class="itemizedlist">
                      <ul type="opencircle">
                        <li style="list-style-type: circle">
                          <p>&#26908;&#32034;BOX&#12395;&#26908;&#32034;&#35486;&#12434;&#20837;&#21147;&#12375;&#12390;&#26908;&#32034;&#12377;&#12427;&#12371;&#12392;&#12418;&#20986;&#26469;&#12414;&#12377;&#12290;</p>
                        </li>
                      </ul>
                    </div>
                  </li>
                  <li style="list-style-type: disc">
                    <p>&#35443;&#32048;&#26908;&#32034;</p>
                    <div class="itemizedlist">
                      <ul type="opencircle">
                        <li style="list-style-type: circle">
                          <p>&#26356;&#12395;&#32048;&#12363;&#12367;&#12450;&#12452;&#12486;&#12512;&#12479;&#12452;&#12503;&#12434;&#25351;&#23450;&#12375;&#12390;&#26908;&#32034;&#12434;&#34892;&#12358;&#12371;&#12392;&#12418;&#20986;&#26469;&#12414;&#12377;&#12290;</p>
                        </li>
                      </ul>
                    </div>
                  </li>
                </ul>
              </div>
            </div>
          </div>
          <div class="section" lang="en" xml:lang="en">
            <div xmlns="" class="titlepage">
              <div>
                <div>
                  <h3 xmlns="http://www.w3.org/1999/xhtml" class="title"><a id="overview.mainfeatures.workflow"></a>2.3. &#12469;&#12452;&#12488;&#21697;&#36074;&#31649;&#29702;&#12398;&#12527;&#12540;&#12463;&#12501;&#12525;&#12540;</h3>
                </div>
              </div>
            </div>
            <p> </p>
            <div class="section" lang="en" xml:lang="en">
              <div xmlns="" class="titlepage">
                <div>
                  <div>
                    <h4 xmlns="http://www.w3.org/1999/xhtml" class="title"><a id="overview.mainfeatures.workflow.userregist"></a>2.3.1. &#30331;&#37682;&#12518;&#12540;&#12470;&#12398;&#31649;&#29702;</h4>
                  </div>
                </div>
              </div>
              <p>&#26032;&#12375;&#12367;&#12518;&#12540;&#12470;&#12434;&#30331;&#37682;&#12377;&#12427;&#12392;&#12365;&#12399;&#12514;&#12487;&#12524;&#12540;&#12479;&#12364;&#30331;&#37682;&#12398;&#20869;&#23481;&#12434;&#30906;&#35469;&#12375;&#12390;&#12363;&#12425;&#23455;&#38555;&#12395;&#12518;&#12540;&#12470;&#12434;&#30331;&#37682;&#12377;&#12427;&#12392;&#12356;&#12358;&#26041;&#27861;&#12364;&#36984;&#25246;&#20986;&#26469;&#12414;&#12377;&#12290;&#65288;&#35373;&#23450;&#30011;&#38754;&#12391;&#22793;&#26356;&#12391;&#12365;&#12414;&#12377;&#65289;</p>
              <p>&#12371;&#12398;&#27231;&#33021;&#12395;&#12424;&#12426;&#24746;&#24847;&#12398;&#12354;&#12427;&#12518;&#12540;&#12470;&#12398;&#30331;&#37682;&#12434;&#38450;&#12368;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
              <div class="figure">
                <a id="overview.mainfeatures.workflow.userregist.fig.overview04"></a>
                <div class="figure-contents">
                  <div class="mediaobject">
                    <img src="images\overview04.png" alt="&#12518;&#12540;&#12470;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;" />
                  </div>
                </div>
                <p class="title">
                  <b>Figure 1.4. &#12518;&#12540;&#12470;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;</b>
                </p>
              </div>
              <br class="figure-break" />
            </div>
            <div class="section" lang="en" xml:lang="en">
              <div xmlns="" class="titlepage">
                <div>
                  <div>
                    <h4 xmlns="http://www.w3.org/1999/xhtml" class="title"><a id="overview.mainfeatures.workflow.reviewsystem"></a>2.3.2. &#12450;&#12452;&#12486;&#12512;&#12398;&#31649;&#29702;</h4>
                  </div>
                </div>
              </div>
              <p>&#12450;&#12452;&#12486;&#12512;&#12434;Public&#12420;Group&#12395;&#30331;&#37682;&#12375;&#12390;&#20844;&#38283;&#21487;&#33021;&#12395;&#12377;&#12427;&#21069;&#27573;&#38542;&#12395;&#12514;&#12487;&#12524;&#12540;&#12479;&#12420;&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#32773;&#12395;&#12424;&#12427;&#26619;&#35501;&#12434;&#34892;&#12358;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12377;&#12290;&#65288;&#35373;&#23450;&#30011;&#38754;&#12391;&#22793;&#26356;&#12391;&#12365;&#12414;&#12377;&#65289;</p>
              <p>WEB&#12469;&#12452;&#12488;&#12395;&#20844;&#38283;&#12373;&#12428;&#12427;&#24773;&#22577;&#12398;&#21697;&#36074;&#31649;&#29702;&#27231;&#33021;&#12392;&#12375;&#12390;&#21033;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
              <div class="figure">
                <a id="overview.mainfeatures.workflow.reviewsystem.fig.overview05"></a>
                <div class="figure-contents">
                  <div class="mediaobject">
                    <img src="images\overview05.png" alt="&#26619;&#35501;&#12471;&#12473;&#12486;&#12512;" />
                  </div>
                </div>
                <p class="title">
                  <b>Figure 1.5. &#26619;&#35501;&#12471;&#12473;&#12486;&#12512;</b>
                </p>
              </div>
              <br class="figure-break" />
            </div>
          </div>
          <div class="section" lang="en" xml:lang="en">
            <div xmlns="" class="titlepage">
              <div>
                <div>
                  <h3 xmlns="http://www.w3.org/1999/xhtml" class="title"><a id="overview.mainfeatures.metadata"></a>2.4. &#12513;&#12479;&#12487;&#12540;&#12479;</h3>
                </div>
              </div>
            </div>
            <p> </p>
            <div class="section" lang="en" xml:lang="en">
              <div xmlns="" class="titlepage">
                <div>
                  <div>
                    <h4 xmlns="http://www.w3.org/1999/xhtml" class="title"><a id="overview.mainfeatures.metadata.harvest"></a>2.4.1. &#12513;&#12479;&#12487;&#12540;&#12479;&#12434;&#21033;&#29992;&#12375;&#12383;&#20182;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12469;&#12452;&#12488;&#12363;&#12425;&#12398;&#26908;&#32034;&#12364;&#21487;&#33021;</h4>
                  </div>
                </div>
              </div>
              <div class="itemizedlist">
                <ul type="bullet">
                  <li style="list-style-type: disc">
                    <p>OAI-PMH&#12395;&#23550;&#24540;&#12375;&#12383;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12469;&#12452;&#12488;&#12392;&#36899;&#25658;&#12364;&#21487;&#33021;</p>
                    <div class="itemizedlist">
                      <ul type="opencircle">
                        <li style="list-style-type: circle">
                          <p>&#12522;&#12509;&#12472;&#12488;&#12522;&#12289;&#12495;&#12540;&#12505;&#12473;&#12479;&#12393;&#12385;&#12425;&#12395;&#12418;&#12394;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
                        </li>
                        <li style="list-style-type: circle">
                          <p>&#12513;&#12479;&#12487;&#12540;&#12479; &#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;</p>
                          <div class="itemizedlist">
                            <ul type="bullet">
                              <li style="list-style-type: disc">
                                <p>&#20197;&#19979;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12395;&#23550;&#24540;&#65306;OAI-DC, JUNII, JUNII2</p>
                              </li>
                            </ul>
                          </div>
                        </li>
                      </ul>
                    </div>
                  </li>
                </ul>
              </div>
              <div class="figure">
                <a id="overview.mainfeatures.metadata.harvest.fig.overview06"></a>
                <div class="figure-contents">
                  <div class="mediaobject">
                    <img src="images\overview06.png" alt="&#12513;&#12479;&#12487;&#12540;&#12479;&#12434;&#21033;&#29992;&#12375;&#12383;&#20182;DB&#12363;&#12425;&#12398;&#26908;&#32034;" />
                  </div>
                </div>
                <p class="title">
                  <b>Figure 1.6. &#12513;&#12479;&#12487;&#12540;&#12479;&#12434;&#21033;&#29992;&#12375;&#12383;&#20182;DB&#12363;&#12425;&#12398;&#26908;&#32034;</b>
                </p>
              </div>
              <br class="figure-break" />
            </div>
          </div>
          <div class="section" lang="en" xml:lang="en">
            <div xmlns="" class="titlepage">
              <div>
                <div>
                  <h3 xmlns="http://www.w3.org/1999/xhtml" class="title"><a id="overview.mainfeatures.accessory"></a>2.5. XooNIps&#12398;&#12381;&#12398;&#20182;&#12398;&#27231;&#33021;</h3>
                </div>
              </div>
            </div>
            <p> </p>
            <div class="section" lang="en" xml:lang="en">
              <div xmlns="" class="titlepage">
                <div>
                  <div>
                    <h4 xmlns="http://www.w3.org/1999/xhtml" class="title"><a id="overview.mainfeatures.accessory.improve"></a>2.5.1. &#12469;&#12452;&#12488;&#12398;&#36939;&#29992;&#21177;&#29575;&#21521;&#19978;&#12398;&#28858;&#12398;&#27231;&#33021;</h4>
                  </div>
                </div>
              </div>
              <div class="itemizedlist">
                <ul type="bullet">
                  <li style="list-style-type: disc">
                    <p>&#12452;&#12531;&#12509;&#12540;&#12488;&#12392;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;</p>
                    <p>WEB&#12469;&#12452;&#12488;&#12434;&#21029;&#12398;&#12469;&#12540;&#12496;&#27231;&#12395;&#31227;&#21205;&#12373;&#12379;&#12427;&#38555;&#12394;&#12393;&#12395;&#21033;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
                  </li>
                  <li style="list-style-type: disc">
                    <p>&#12450;&#12463;&#12475;&#12473;&#12525;&#12464;&#35299;&#26512;&#27231;&#33021;</p>
                    <div class="itemizedlist">
                      <ul type="opencircle">
                        <li style="list-style-type: circle">
                          <p>WEB&#12469;&#12452;&#12488;&#12398;&#21033;&#29992;&#29366;&#27841;&#12364;&#35352;&#37682;&#12373;&#12428;&#12390;&#12356;&#12427;&#12452;&#12505;&#12531;&#12488;&#12525;&#12464;&#12398;&#30906;&#35469;&#12364;&#20986;&#26469;&#12414;&#12377;&#12290;</p>
                        </li>
                      </ul>
                    </div>
                  </li>
                </ul>
              </div>
            </div>
            <div class="section" lang="en" xml:lang="en">
              <div xmlns="" class="titlepage">
                <div>
                  <div>
                    <h4 xmlns="http://www.w3.org/1999/xhtml" class="title"><a id="overview.mainfeatures.accessory.incentive"></a>2.5.2. &#12452;&#12531;&#12475;&#12531;&#12486;&#12451;&#12502;&#12398;&#21521;&#19978;&#27231;&#33021;</h4>
                  </div>
                </div>
              </div>
              <div class="itemizedlist">
                <ul type="bullet">
                  <li style="list-style-type: disc">
                    <p>&#12518;&#12540;&#12470;&#24773;&#22577;&#12398;&#32057;&#20171;&#27231;&#33021;&#12392;&#12375;&#12390;&#20197;&#19979;&#12398;&#12424;&#12358;&#12394;&#24773;&#22577;&#12434;&#20844;&#38283;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
                    <div class="itemizedlist">
                      <ul type="opencircle">
                        <li style="list-style-type: circle">
                          <p>&#12518;&#12540;&#12470;&#12398;&#24441;&#32887;</p>
                        </li>
                        <li style="list-style-type: circle">
                          <p>&#32076;&#27508;</p>
                        </li>
                        <li style="list-style-type: circle">
                          <p>&#26989;&#32318;</p>
                        </li>
                      </ul>
                    </div>
                  </li>
                  <li style="list-style-type: disc">
                    <p>&#20197;&#19979;&#12398;&#24773;&#22577;&#12434;&#12521;&#12531;&#12461;&#12531;&#12464;&#34920;&#31034;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
                    <div class="itemizedlist">
                      <ul type="opencircle">
                        <li style="list-style-type: circle">
                          <p>&#26032;&#35215;&#12450;&#12452;&#12486;&#12512;</p>
                        </li>
                        <li style="list-style-type: circle">
                          <p>&#26368;&#12418;&#12450;&#12463;&#12475;&#12473;&#12373;&#12428;&#12383;&#12450;&#12452;&#12486;&#12512;</p>
                        </li>
                        <li style="list-style-type: circle">
                          <p>&#26368;&#12418;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12450;&#12452;&#12486;&#12512;</p>
                        </li>
                        <li style="list-style-type: circle">
                          <p>&#26368;&#12418;&#22810;&#12367;&#12450;&#12452;&#12486;&#12512;&#12434;&#30331;&#37682;&#12375;&#12383;&#12518;&#12540;&#12470;</p>
                        </li>
                        <li style="list-style-type: circle">
                          <p>&#26368;&#12418;&#26908;&#32034;&#12373;&#12428;&#12383;&#12461;&#12540;&#12527;&#12540;&#12489;</p>
                        </li>
                      </ul>
                    </div>
                  </li>
                </ul>
              </div>
            </div>
          </div>
        </div>
      </div>
      <div class="navfooter">
        <hr />
        <table width="100%" summary="Navigation footer">
          <tr>
            <td width="40%" align="left"><a accesskey="p" href="index.html"><img src="images\etc\prev.gif" alt="Prev" /></a> </td>
            <td width="20%" align="center"> </td>
            <td width="40%" align="right"> <a accesskey="n" href="startguide.html"><img src="images\etc\next.gif" alt="Next" /></a></td>
          </tr>
          <tr>
            <td width="40%" align="left" valign="top"> </td>
            <td width="20%" align="center">
              <a accesskey="h" href="index.html">
                <img src="images\etc\home.gif" alt="Home" />
              </a>
            </td>
            <td width="40%" align="right" valign="top"> </td>
          </tr>
        </table>
      </div>
      <div class="lastupdated">Last updated: 2011/07/12</div>
    </div>
  </body>
</html>
